logik/pl/sorten.html
---
layout: page
title: Sorten
---

<p>
<b>Sorten</b> kann man sich wie Datentypen von Programmiersprachen
vorstellen. Sorten schreiben wir mit großem Anfangsbuchstaben, z.B.
\(\text{Number}\).
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Sortenmenge</h2>
<div class="outline-text-2" id="text-1">
<p>
Eine nichtleere Menge von Sorten \(S = \{s_0, s_1,\dots\}\) heißt <i>Sortenmenge</i>.
Die Elemente von \(S\) heißen <i>Sorten</i>.
</p>

<p>
Mengenoperationen auf sortierten Mengen zur selben Sortenmenge werden
sortenweise auf die Elemente der sortierten Mengen übertragen, d.h. es
gilt z.B.:
</p>

<p>
\(\{M_s\}_{s\in S} \cap \{N_s\}_{s \in S} := \{M_s \cap N_s\}_{s\in S}\)
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Einsortigkeit</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Enthält eine Sortenmenge \(S\) lediglich ein Element, so spricht man von
<b>Einsortigkeit</b>. Das eizige Element von \(S\) wird dann mit \(s\) bezeichnet.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> S-sortierte Menge</h2>
<div class="outline-text-2" id="text-2">
<p>
Eine \(S\)-sortiert Menge \(M\) ist eine Menge von <b>nichtleeren</b> Mengen, in
der jede nicht-leeren Menge einer Sorte der Sortenmenge \(S\) zugeordent
werden kann. Wir sagen die Elemtente von \(M\) können mit den Elementen
von \(S\) <b>indiziert</b> werden und schreiben \(M = \{M_s\}_{s\in S}\), wobei
\(M_s \neq \emptyset\) für jedes \(s\in S\) gilt.
</p>
</div>
</div>
